bench/results/java17/20260309T233058Z/load.stdout.txt
{"ok": true, "tool": "wrk", "url": "http://localhost:8080/api/gateway/orders", "duration_s": 120, "warmup_s": 60, "concurrency": 25, "threads": 4, "requests_per_sec": 6498.41, "p50": "3.47ms", "p95": "6.73ms", "p99": "7.99ms", "http_non2xx": "na", "socket_errors": {}, "raw_excerpt": "Running 2m test @ http://localhost:8080/api/gateway/orders\n  4 threads and 25 connections\n  Thread Stats   Avg      Stdev     Max   +/- Stdev\n    Latency     3.70ms    1.37ms  27.32ms   72.24%\n    Req/Sec     1.63k   152.30     1.91k    75.60%\n  Latency Distribution\n     50%    3.47ms\n     75%    4.42ms\n     90%    5.47ms\n     99%    7.99ms\n  779985 requests in 2.00m, 177.78MB read\nRequests/sec:   6498.41\nTransfer/sec:      1.48MB"}